FastLED/FastLED/src/platforms/arm/stm32/stm32_gpio_timer_helpers.cpp.hpp
// IWYU pragma: private

/// @file stm32_gpio_timer_helpers.cpp
/// @brief Shared GPIO and Timer helper implementations for STM32
///
/// This file centralizes common GPIO and Timer utility functions used across
/// STM32 implementations.
///
/// IMPORTANT: This file requires STM32 HAL types (GPIO_TypeDef, TIM_TypeDef, etc.)
/// which are available when STM32duino core is present.

// Include platform detection header for FL_IS_STM32
#include "platforms/arm/stm32/is_stm32.h"
#include "fl/stl/has_include.h"

// Platform guard using standardized FL_IS_STM32 macro
#if defined(FL_IS_STM32)

#include "platforms/arm/stm32/stm32_capabilities.h"

// STM32duino core headers - provides HAL includes and pin mapping functions
// IMPORTANT: The Maple framework (used by stm32f103cb maple_mini) does NOT have
// stm32_def.h or HAL types. We set FL_STM32_HAS_HAL only when the HAL is available.
// All other STM32duino-specific headers are only included when HAL is available,
// because on Maple the pins_arduino.h includes variant.h which has undefined macros.
#if FL_HAS_INCLUDE("stm32_def.h")
#include "stm32_def.h"  // STM32duino core - provides HAL includes
#define FL_STM32_HAS_HAL  // Marker that STM32 HAL types are available
#if FL_HAS_INCLUDE("pins_arduino.h")
#include "pins_arduino.h"  // Arduino pin mapping - provides digitalPinToPinName macro
#endif
#if FL_HAS_INCLUDE("PeripheralPins.h")
// IWYU pragma: begin_keep
#include <PeripheralPins.h>  // Pin mapping tables
// IWYU pragma: end_keep
#endif
#if FL_HAS_INCLUDE("pinmap.h")
// IWYU pragma: begin_keep
#include <pinmap.h>  // Pin mapping functions
// IWYU pragma: end_keep
#endif
#endif  // FL_HAS_INCLUDE("stm32_def.h")

#include "platforms/arm/stm32/stm32_capabilities.h"
#include "fl/log/log.h"
#include "fl/log/log.h"
#include "fl/stl/cstring.h"

namespace fl {
namespace stm32 {

// All function definitions below require STM32 HAL types (GPIO_TypeDef, TIM_TypeDef, etc.)
// which are only available when STM32duino core is present (not on Maple framework).
#ifdef FL_STM32_HAS_HAL

// ============================================================================
// GPIO Helper Functions
// ============================================================================

GPIO_TypeDef* getGPIOPort(u8 pin) {
#ifdef HAL_GPIO_MODULE_ENABLED
    PinName pin_name = digitalPinToPinName(pin);
    if (pin_name == NC) {
        return nullptr;
    }

    // STM32H7 Mbed core doesn't provide get_GPIO_Port/STM_PORT macros
    // Use direct port extraction from PinName
#if defined(FL_IS_STM32_H7)
    // PinName format: (port << 4) | pin_number
    // Extract port number and map to GPIO_TypeDef*
    u32 port_idx = STM_PORT(pin_name);
    static GPIO_TypeDef* const gpio_ports[] = {
        GPIOA, GPIOB, GPIOC, GPIOD, GPIOE, GPIOF, GPIOG, GPIOH,
#ifdef GPIOI
        GPIOI,
#endif
#ifdef GPIOJ
        GPIOJ,
#endif
#ifdef GPIOK
        GPIOK
#endif
    };
    if (port_idx < sizeof(gpio_ports) / sizeof(gpio_ports[0])) {
        return gpio_ports[port_idx];
    }
    return nullptr;
#else
    return get_GPIO_Port(STM_PORT(pin_name));
#endif
#else
    (void)pin;
    return nullptr;
#endif
}

u32 getGPIOPin(u8 pin) {
#ifdef HAL_GPIO_MODULE_ENABLED
    PinName pin_name = digitalPinToPinName(pin);
    if (pin_name == NC) {
        return 0;
    }

    // STM32H7 Mbed core doesn't provide STM_GPIO_PIN macro
    // Use direct pin extraction from PinName
#if defined(FL_IS_STM32_H7)
    // PinName format: (port << 4) | pin_number
    // Extract pin number and convert to GPIO_PIN_x define
    u32 pin_num = STM_PIN(pin_name);
    return (1 << pin_num);  // Convert to GPIO_PIN_0, GPIO_PIN_1, etc.
#else
    return STM_GPIO_PIN(pin_name);
#endif
#else
    (void)pin;
    return 0;
#endif
}

void enableGPIOClock(GPIO_TypeDef* port) {
#ifdef HAL_GPIO_MODULE_ENABLED
    if (port == nullptr) {
        return;
    }

    // Enable GPIO clock based on port
#ifdef GPIOA
    if (port == GPIOA) {
        __HAL_RCC_GPIOA_CLK_ENABLE();
        return;
    }
#endif
#ifdef GPIOB
    if (port == GPIOB) {
        __HAL_RCC_GPIOB_CLK_ENABLE();
        return;
    }
#endif
#ifdef GPIOC
    if (port == GPIOC) {
        __HAL_RCC_GPIOC_CLK_ENABLE();
        return;
    }
#endif
#ifdef GPIOD
    if (port == GPIOD) {
        __HAL_RCC_GPIOD_CLK_ENABLE();
        return;
    }
#endif
#ifdef GPIOE
    if (port == GPIOE) {
        __HAL_RCC_GPIOE_CLK_ENABLE();
        return;
    }
#endif
#ifdef GPIOF
    if (port == GPIOF) {
        __HAL_RCC_GPIOF_CLK_ENABLE();
        return;
    }
#endif
#ifdef GPIOG
    if (port == GPIOG) {
        __HAL_RCC_GPIOG_CLK_ENABLE();
        return;
    }
#endif
#ifdef GPIOH
    if (port == GPIOH) {
        __HAL_RCC_GPIOH_CLK_ENABLE();
        return;
    }
#endif
#ifdef GPIOI
    if (port == GPIOI) {
        __HAL_RCC_GPIOI_CLK_ENABLE();
        return;
    }
#endif
#ifdef GPIOJ
    if (port == GPIOJ) {
        __HAL_RCC_GPIOJ_CLK_ENABLE();
        return;
    }
#endif
#ifdef GPIOK
    if (port == GPIOK) {
        __HAL_RCC_GPIOK_CLK_ENABLE();
        return;
    }
#endif
#else
    (void)port;
#endif
}

bool configurePinAsOutput(u8 pin, u32 speed) {
#ifdef HAL_GPIO_MODULE_ENABLED
    GPIO_TypeDef* port = getGPIOPort(pin);
    u32 pin_mask = getGPIOPin(pin);

    if (port == nullptr || pin_mask == 0) {
        return false;
    }

    // Enable GPIO clock
    enableGPIOClock(port);

    // Configure as output
    GPIO_InitTypeDef GPIO_InitStruct = {};
    GPIO_InitStruct.Pin = pin_mask;
    GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = speed;

    HAL_GPIO_Init(port, &GPIO_InitStruct);
    return true;
#else
    (void)pin;
    (void)speed;
    return false;
#endif
}

bool configurePinAsTimerAF(u8 pin, TIM_TypeDef* timer, u32 speed) {
#ifdef HAL_GPIO_MODULE_ENABLED
    GPIO_TypeDef* port = getGPIOPort(pin);
    u32 pin_mask = getGPIOPin(pin);
    PinName pin_name = digitalPinToPinName(pin);

    if (port == nullptr || pin_mask == 0 || pin_name == NC) {
        return false;
    }

