FastLED/FastLED/src/platforms/arm/stm32/stm32_gpio_timer_helpers.cpp.hpp
    // Enable GPIO clock
    enableGPIOClock(port);

#if defined(FASTLED_STM32_GPIO_USES_AFIO_REMAP)
    // STM32F1: Use AFIO remapping
    // Enable AFIO clock
    __HAL_RCC_AFIO_CLK_ENABLE();

    // Configure pin as alternate function push-pull
    GPIO_InitTypeDef GPIO_InitStruct = {};
    GPIO_InitStruct.Pin = pin_mask;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed = speed;

    HAL_GPIO_Init(port, &GPIO_InitStruct);

    // Note: F1 remapping is timer-specific and usually done globally
    // Applications may need to call __HAL_AFIO_REMAP_TIMx_ENABLE() separately
    // based on specific pin/timer combinations
    return true;

#elif defined(FASTLED_STM32_GPIO_USES_AF_NUMBERS)
    // STM32F2/F4/F7/H7/L4/G4/U5: Use AF numbers
    // Find the AF number for this pin and timer using STM32duino pinmap
    // Note: H7 uses PinMap_PWM instead of PinMap_TIM
    #if defined(FL_IS_STM32_H7)
        u32 af_mode = pinmap_find_function(pin_name, PinMap_PWM);
    #else
        u32 af_mode = pinmap_find_function(pin_name, PinMap_TIM);
    #endif

    if (af_mode == (u32)NC) {
        // Pin doesn't support Timer AF
        FL_WARN("STM32: Pin %s does not support Timer AF", pin);
        return false;
    }

    // Configure as alternate function
    GPIO_InitTypeDef GPIO_InitStruct = {};
    GPIO_InitStruct.Pin = pin_mask;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = speed;
    GPIO_InitStruct.Alternate = af_mode;

    HAL_GPIO_Init(port, &GPIO_InitStruct);
    return true;
#else
    // Unknown platform
    return false;
#endif

#else
    (void)pin;
    (void)timer;
    (void)speed;
    return false;
#endif
}

bool isValidPin(u8 pin) {
#ifdef HAL_GPIO_MODULE_ENABLED
    PinName pin_name = digitalPinToPinName(pin);
    return pin_name != NC;
#else
    (void)pin;
    return false;
#endif
}

// ============================================================================
// Timer Helper Functions
// ============================================================================
// These functions are only needed for hardware SPI implementations

#if defined(FL_STM32_HAS_SPI_HW_2) || defined(FL_STM32_HAS_SPI_HW_4) || defined(FL_STM32_HAS_SPI_HW_8)

TIM_TypeDef* selectTimer(int bus_id) {
#if defined(HAL_TIM_MODULE_ENABLED)
    // Timer allocation strategy (based on HARDWARE_RESOURCES.md):
    // Bus 0: TIM2 (32-bit, general-purpose, widely available)
    // Bus 1: TIM3 (16-bit, general-purpose)
    // Bus 2: TIM4 (16-bit, general-purpose)
    // Bus 3: TIM5 (32-bit, available on F4/F7/H7)

    switch (bus_id) {
#ifdef TIM2
        case 0: return TIM2;
#endif
#ifdef TIM3
        case 1: return TIM3;
#endif
#ifdef TIM4
        case 2: return TIM4;
#endif
#ifdef TIM5
        case 3: return TIM5;
#endif
        default: return nullptr;
    }
#else
    (void)bus_id;
    return nullptr;
#endif
}

void enableTimerClock(TIM_TypeDef* timer) {
#if defined(HAL_TIM_MODULE_ENABLED)
    if (timer == nullptr) {
        return;
    }

    // Enable timer clock based on peripheral
#ifdef TIM2
    if (timer == TIM2) {
        __HAL_RCC_TIM2_CLK_ENABLE();
        return;
    }
#endif
#ifdef TIM3
    if (timer == TIM3) {
        __HAL_RCC_TIM3_CLK_ENABLE();
        return;
    }
#endif
#ifdef TIM4
    if (timer == TIM4) {
        __HAL_RCC_TIM4_CLK_ENABLE();
        return;
    }
#endif
#ifdef TIM5
    if (timer == TIM5) {
        __HAL_RCC_TIM5_CLK_ENABLE();
        return;
    }
#endif
#ifdef TIM8
    if (timer == TIM8) {
        __HAL_RCC_TIM8_CLK_ENABLE();
        return;
    }
#endif
#else
    (void)timer;
#endif
}

u32 getTimerClockFreq(TIM_TypeDef* timer) {
#if defined(HAL_TIM_MODULE_ENABLED) && defined(HAL_RCC_MODULE_ENABLED)
    if (timer == nullptr) {
        return 0;
    }

    // Timer clock source depends on APB bus and RCC configuration
    // TIM2, TIM3, TIM4, TIM5, TIM6, TIM7, TIM12-14 are on APB1
    // TIM1, TIM8, TIM9-11, TIM15-17 are on APB2

    // Determine which APB bus this timer is on
    bool is_apb1 = (timer == TIM2 || timer == TIM3 || timer == TIM4
#ifdef FASTLED_STM32_HAS_TIM5
        || timer == TIM5
#endif
#ifdef TIM6
        || timer == TIM6
#endif
#ifdef TIM7
        || timer == TIM7
#endif
    );

    // Get APB clock frequency using HAL
    u32 apb_freq = is_apb1 ? HAL_RCC_GetPCLK1Freq() : HAL_RCC_GetPCLK2Freq();

    // Timer clock = APB clock × 2 if APB prescaler != 1 (per STM32 reference manual)
    // Check RCC prescaler bits to determine if 2x multiplier applies
    u32 timer_freq = apb_freq;

#if defined(FL_IS_STM32_F1) || defined(FL_IS_STM32_F2) || defined(FL_IS_STM32_F4) || defined(FL_IS_STM32_F7)
    // F1/F2/F4/F7: Check PPRE bits in RCC->CFGR
    if (is_apb1) {
        // Check APB1 prescaler (PPRE1 bits [10:8])
        u32 ppre1 = (RCC->CFGR & RCC_CFGR_PPRE1) >> 8;
        if (ppre1 >= 4) {  // Prescaler != 1 (values 4-7 mean /2, /4, /8, /16)
            timer_freq = apb_freq * 2;
        }
    } else {
        // Check APB2 prescaler (PPRE2 bits [13:11])
        u32 ppre2 = (RCC->CFGR & RCC_CFGR_PPRE2) >> 11;
        if (ppre2 >= 4) {  // Prescaler != 1
            timer_freq = apb_freq * 2;
        }
    }
#elif defined(FL_IS_STM32_H7)
    // H7: Check D2PPRE bits in RCC->D2CFGR (more complex clock tree)
    if (is_apb1) {
        u32 d2ppre1 = (RCC->D2CFGR & RCC_D2CFGR_D2PPRE1) >> RCC_D2CFGR_D2PPRE1_Pos;
        if (d2ppre1 >= 4) {
            timer_freq = apb_freq * 2;
        }
    } else {
        u32 d2ppre2 = (RCC->D2CFGR & RCC_D2CFGR_D2PPRE2) >> RCC_D2CFGR_D2PPRE2_Pos;
        if (d2ppre2 >= 4) {
            timer_freq = apb_freq * 2;
        }
    }
#elif defined(FL_IS_STM32_L4) || defined(FL_IS_STM32_G4)
    // L4/G4: Similar to F4 but with different register names
    if (is_apb1) {
        u32 ppre1 = (RCC->CFGR & RCC_CFGR_PPRE1) >> RCC_CFGR_PPRE1_Pos;
        if (ppre1 >= 4) {
            timer_freq = apb_freq * 2;
        }
    } else {
        u32 ppre2 = (RCC->CFGR & RCC_CFGR_PPRE2) >> RCC_CFGR_PPRE2_Pos;
        if (ppre2 >= 4) {
            timer_freq = apb_freq * 2;
        }
    }
#else
    // Generic fallback: assume 2x multiplier (most common configuration)
    timer_freq = apb_freq * 2;
#endif

    return timer_freq;

#else
    (void)timer;
    return 0;
#endif
}

bool initTimerPWM(TIM_HandleTypeDef* htim, TIM_TypeDef* timer, u32 frequency_hz) {
#if defined(HAL_TIM_MODULE_ENABLED)
    if (htim == nullptr || timer == nullptr || frequency_hz == 0) {
        return false;
    }

    // Enable timer clock
    enableTimerClock(timer);

    // Get timer clock frequency
    u32 timer_clock = getTimerClockFreq(timer);
    if (timer_clock == 0) {
        FL_WARN("STM32: Failed to get timer clock frequency");
        return false;
    }

