FastLED/FastLED/src/platforms/arm/stm32/stm32_gpio_timer_helpers.cpp.hpp
    // Calculate period (ARR register value)
    // Period = (Timer_Clock / Desired_Frequency) - 1
    u32 period = (timer_clock / frequency_hz) - 1;

    // Validate period is within timer range
    // 16-bit timers: max 65535, 32-bit timers: max 4294967295
    bool is_32bit = (timer == TIM2
#ifdef FASTLED_STM32_HAS_TIM5
        || timer == TIM5
#endif
    );
    u32 max_period = is_32bit ? 0xFFFFFFFF : 0xFFFF;

    if (period > max_period) {
        FL_WARN("STM32: Timer period %s exceeds max %s", period, max_period);
        return false;
    }

    // Configure timer base using provided handle
    fl::memset(htim, 0, sizeof(TIM_HandleTypeDef));  // Clear handle
    htim->Instance = timer;
    htim->Init.Prescaler = 0;  // No prescaling for maximum frequency
    htim->Init.CounterMode = TIM_COUNTERMODE_UP;
    htim->Init.Period = period;
    htim->Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    htim->Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;

    if (HAL_TIM_Base_Init(htim) != HAL_OK) {
        FL_WARN("STM32: Timer base init failed");
        return false;
    }

    // Configure PWM mode on channel 1 (50% duty cycle)
    TIM_OC_InitTypeDef sConfigOC = {};
    sConfigOC.OCMode = TIM_OCMODE_PWM1;
    sConfigOC.Pulse = period / 2;  // 50% duty cycle
    sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
    sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;

    if (HAL_TIM_PWM_ConfigChannel(htim, &sConfigOC, TIM_CHANNEL_1) != HAL_OK) {
        FL_WARN("STM32: Timer PWM config failed");
        return false;
    }

    return true;
#else
    (void)htim;
    (void)timer;
    (void)frequency_hz;
    return false;
#endif
}

bool startTimer(TIM_HandleTypeDef* htim) {
#if defined(HAL_TIM_MODULE_ENABLED)
    if (htim == nullptr || htim->Instance == nullptr) {
        return false;
    }

    // Start PWM on channel 1
    if (HAL_TIM_PWM_Start(htim, TIM_CHANNEL_1) != HAL_OK) {
        FL_WARN("STM32: Failed to start timer PWM");
        return false;
    }

    return true;
#else
    (void)htim;
    return false;
#endif
}

void stopTimer(TIM_HandleTypeDef* htim) {
#if defined(HAL_TIM_MODULE_ENABLED)
    if (htim == nullptr || htim->Instance == nullptr) {
        return;
    }

    // Stop PWM on channel 1
    HAL_TIM_PWM_Stop(htim, TIM_CHANNEL_1);
#else
    (void)htim;
#endif
}

u8 getTimerChannel(u8 pin, TIM_TypeDef* timer) {
#if defined(HAL_TIM_MODULE_ENABLED) && defined(FASTLED_STM32_GPIO_USES_AF_NUMBERS)
    // For F2/F4/F7/H7/L4/G4/U5: Use pinmap_pinAF to determine channel
    PinName pin_name = digitalPinToPinName(pin);
    if (pin_name == NC) {
        return 0;
    }

    // Try to find which channel this pin supports for this timer
    // This is platform-specific - pinmap_pinAF tells us the AF number,
    // but we need to check the pin map to determine the channel
    // For now, default to channel 1 (most common for clock output)
    // TODO: Implement proper channel detection using pin maps

    (void)timer;  // Unused for now
    return 1;  // Default to channel 1

#elif defined(FASTLED_STM32_GPIO_USES_AFIO_REMAP)
    // For F1: Channel mapping depends on AFIO remap configuration
    // Default to channel 1 for simplicity
    (void)pin;
    (void)timer;
    return 1;

#else
    (void)pin;
    (void)timer;
    return 0;
#endif
}

#endif  // FL_STM32_HAS_SPI_HW_*

// ============================================================================
// DMA Helper Functions (Stream-based DMA for F2/F4/F7/H7/L4)
// ============================================================================
// These functions are only available when DMA streams are supported

#if defined(FASTLED_STM32_HAS_DMA_STREAMS) && (defined(FL_STM32_HAS_SPI_HW_2) || defined(FL_STM32_HAS_SPI_HW_4) || defined(FL_STM32_HAS_SPI_HW_8))

void enableDMAClock(DMA_TypeDef* dma) {
#if defined(HAL_DMA_MODULE_ENABLED)
    if (dma == nullptr) {
        return;
    }

#ifdef DMA1
    if (dma == DMA1) {
        __HAL_RCC_DMA1_CLK_ENABLE();
        return;
    }
#endif
#ifdef DMA2
    if (dma == DMA2) {
        __HAL_RCC_DMA2_CLK_ENABLE();
        return;
    }
#endif
#else
    (void)dma;
#endif
}

DMA_Stream_TypeDef* getDMAStream(TIM_TypeDef* timer, int bus_id, int lane) {
#if defined(FASTLED_STM32_HAS_DMA_STREAMS)
    // STM32F4/F7/H7 DMA allocation strategy (from HARDWARE_RESOURCES.md):
    // Dual-SPI uses 2 streams per bus
    // Bus 0 (TIM2): DMA1 Stream 1, 7
    // Bus 1 (TIM3): DMA1 Stream 2, 4
    // Bus 2 (TIM4): DMA1 Stream 6, 3
    // Bus 3 (TIM5): DMA1 Stream 0, 5

#ifdef DMA1_Stream0
    if (timer == TIM2) {
        // TIM2_UP on DMA1: Stream 1 (Channel 3), Stream 7 (Channel 3)
        // See STM32F4 RM0090 Table 42
        return (lane == 0) ? DMA1_Stream1 : DMA1_Stream7;
    }
#ifdef TIM3
    if (timer == TIM3) {
        // TIM3_UP on DMA1: Stream 2 (Channel 5), Stream 4 (Channel 5)
        // See STM32F4 RM0090 Table 42
        return (lane == 0) ? DMA1_Stream2 : DMA1_Stream4;
    }
#endif
#ifdef TIM4
    if (timer == TIM4) {
        // TIM4_UP on DMA1: Stream 6 (Channel 2), Stream 3 (Channel 2) - note reversed order
        // See STM32F4 RM0090 Table 42
        return (lane == 0) ? DMA1_Stream6 : DMA1_Stream3;
    }
#endif
#ifdef TIM5
    if (timer == TIM5) {
        // TIM5_UP on DMA1: Stream 0 (Channel 6), Stream 5 (Channel 6) - note Stream 6 also valid
        // See STM32F4 RM0090 Table 42
        return (lane == 0) ? DMA1_Stream0 : DMA1_Stream5;
    }
#endif
#endif
#else
    (void)timer;
    (void)bus_id;
    (void)lane;
#endif
    return nullptr;
}

u32 getDMAChannel(TIM_TypeDef* timer) {
#if defined(FASTLED_STM32_HAS_DMA_STREAMS)

#if defined(FL_IS_STM32_H7)
    // STM32H7 uses DMAMUX - return DMA request ID instead of channel
    // See STM32H7 reference manual, Table "DMAMUX1 request mapping"
#ifdef TIM2
    if (timer == TIM2) {
        return DMA_REQUEST_TIM2_UP;  // DMAMUX request ID for TIM2_UP
    }
#endif
#ifdef TIM3
    if (timer == TIM3) {
        return DMA_REQUEST_TIM3_UP;  // DMAMUX request ID for TIM3_UP
    }
#endif
#ifdef TIM4
    if (timer == TIM4) {
        return DMA_REQUEST_TIM4_UP;  // DMAMUX request ID for TIM4_UP
    }
#endif
#ifdef TIM5
    if (timer == TIM5) {
        return DMA_REQUEST_TIM5_UP;  // DMAMUX request ID for TIM5_UP
    }
#endif

#else
    // STM32F2/F4/F7/L4: Use fixed DMA channel numbers
    // TIM2_UP: Channel 3
    // TIM3_UP: Channel 5
    // TIM4_UP: Channel 2
    // TIM5_UP: Channel 6

