FastLED/FastLED/src/platforms/arm/stm32/stm32_gpio_timer_helpers.cpp.hpp
#ifdef TIM2
    if (timer == TIM2) {
        return DMA_CHANNEL_3;
    }
#endif
#ifdef TIM3
    if (timer == TIM3) {
        return DMA_CHANNEL_5;
    }
#endif
#ifdef TIM4
    if (timer == TIM4) {
        return DMA_CHANNEL_2;
    }
#endif
#ifdef TIM5
    if (timer == TIM5) {
        return DMA_CHANNEL_6;
    }
#endif
#endif  // FL_IS_STM32_H7

#else
    (void)timer;
#endif
    return 0xFF;  // Invalid channel
}

DMA_TypeDef* getDMAController(DMA_Stream_TypeDef* stream) {
#if defined(FASTLED_STM32_HAS_DMA_STREAMS)
#ifdef DMA1_Stream0
    if (stream >= DMA1_Stream0 && stream <= DMA1_Stream7) {
        return DMA1;
    }
#endif
#ifdef DMA2_Stream0
    if (stream >= DMA2_Stream0 && stream <= DMA2_Stream7) {
        return DMA2;
    }
#endif
#else
    (void)stream;
#endif
    return nullptr;
}

u8 getStreamIndex(DMA_Stream_TypeDef* stream) {
#if defined(FASTLED_STM32_HAS_DMA_STREAMS)
    // Use lookup table to avoid pointer arithmetic
    // (pointer arithmetic fails with DMA stream structures)
#ifdef DMA1_Stream0
    static const DMA_Stream_TypeDef* dma1_streams[] = {
        DMA1_Stream0, DMA1_Stream1, DMA1_Stream2, DMA1_Stream3,
        DMA1_Stream4, DMA1_Stream5, DMA1_Stream6, DMA1_Stream7
    };
    for (u8 i = 0; i < 8; i++) {
        if (stream == dma1_streams[i]) {
            return i;
        }
    }
#endif
#ifdef DMA2_Stream0
    static const DMA_Stream_TypeDef* dma2_streams[] = {
        DMA2_Stream0, DMA2_Stream1, DMA2_Stream2, DMA2_Stream3,
        DMA2_Stream4, DMA2_Stream5, DMA2_Stream6, DMA2_Stream7
    };
    for (u8 i = 0; i < 8; i++) {
        if (stream == dma2_streams[i]) {
            return i;
        }
    }
#endif
#else
    (void)stream;
#endif
    return 0xFF;  // Invalid stream
}

bool initDMA(DMA_Stream_TypeDef* stream, const void* src, volatile void* dst, u32 size, u32 channel) {
#if defined(HAL_DMA_MODULE_ENABLED) && defined(FASTLED_STM32_HAS_DMA_STREAMS)
    if (stream == nullptr || src == nullptr || dst == nullptr || size == 0) {
        return false;
    }

    // Get DMA controller and enable clock
    DMA_TypeDef* dma = getDMAController(stream);
    if (dma == nullptr) {
        return false;
    }
    enableDMAClock(dma);

    // Create DMA handle
    DMA_HandleTypeDef hdma = {};
    hdma.Instance = stream;

    // STM32H7 uses Request (DMAMUX), F4/F7 use Channel
#if defined(FL_IS_STM32_H7)
    hdma.Init.Request = channel;  // On H7, this is actually a DMAMUX request ID
#else
    hdma.Init.Channel = channel;
#endif

    hdma.Init.Direction = DMA_MEMORY_TO_PERIPH;
    hdma.Init.PeriphInc = DMA_PINC_DISABLE;     // Fixed peripheral address
    hdma.Init.MemInc = DMA_MINC_ENABLE;          // Increment memory address
    hdma.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
    hdma.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;
    hdma.Init.Mode = DMA_NORMAL;                 // Not circular
    hdma.Init.Priority = DMA_PRIORITY_HIGH;
    hdma.Init.FIFOMode = DMA_FIFOMODE_DISABLE;

    if (HAL_DMA_Init(&hdma) != HAL_OK) {
        FL_WARN("STM32: DMA init failed");
        return false;
    }

    // Configure transfer addresses and size
    if (HAL_DMA_Start(&hdma, (u32)src, (u32)dst, size) != HAL_OK) {
        FL_WARN("STM32: DMA start failed");
        return false;
    }

    FL_DBG("STM32: DMA stream configured successfully");
    return true;
#else
    (void)stream;
    (void)src;
    (void)dst;
    (void)size;
    (void)channel;
    return false;
#endif
}

bool isDMAComplete(DMA_Stream_TypeDef* stream) {
#if defined(HAL_DMA_MODULE_ENABLED) && defined(FASTLED_STM32_HAS_DMA_STREAMS)
    if (stream == nullptr) {
        return true;
    }

    // Check if stream is enabled (disabled when transfer completes)
    if ((stream->CR & DMA_SxCR_EN) == 0) {
        return true;
    }

    // Check transfer complete flag
    DMA_TypeDef* dma = getDMAController(stream);
    u8 stream_idx = getStreamIndex(stream);

    if (dma == nullptr || stream_idx == 0xFF) {
        return true;  // Assume complete if invalid
    }

#if defined(FL_IS_STM32_H7)
    // STM32H7: Use direct register access instead of LL functions
    // Check the Transfer Complete Interrupt Flag (TCIFx) in LISR/HISR
    if (stream_idx < 4) {
        // Streams 0-3: Use LISR (Low Interrupt Status Register)
        // Bit positions: Stream 0: bit 5, Stream 1: bit 11, Stream 2: bit 21, Stream 3: bit 27
        static const u32 tc_flags[] = {
            DMA_LISR_TCIF0, DMA_LISR_TCIF1, DMA_LISR_TCIF2, DMA_LISR_TCIF3
        };
        return (dma->LISR & tc_flags[stream_idx]) != 0;
    } else {
        // Streams 4-7: Use HISR (High Interrupt Status Register)
        // Bit positions: Stream 4: bit 5, Stream 5: bit 11, Stream 6: bit 21, Stream 7: bit 27
        static const u32 tc_flags[] = {
            DMA_HISR_TCIF4, DMA_HISR_TCIF5, DMA_HISR_TCIF6, DMA_HISR_TCIF7
        };
        return (dma->HISR & tc_flags[stream_idx - 4]) != 0;
    }
#else
    // STM32F2/F4/F7/L4: Use LL driver functions for flag checking (stream-specific)
    // Create function pointer array for TC flag checks
    typedef u32 (*FlagFunc)(DMA_TypeDef*);
    static const FlagFunc tc_funcs[] = {
        LL_DMA_IsActiveFlag_TC0, LL_DMA_IsActiveFlag_TC1,
        LL_DMA_IsActiveFlag_TC2, LL_DMA_IsActiveFlag_TC3,
        LL_DMA_IsActiveFlag_TC4, LL_DMA_IsActiveFlag_TC5,
        LL_DMA_IsActiveFlag_TC6, LL_DMA_IsActiveFlag_TC7
    };

    if (stream_idx < 8) {
        return tc_funcs[stream_idx](dma) != 0;
    }

    return true;
#endif

#else
    (void)stream;
    return true;
#endif
}

void clearDMAFlags(DMA_Stream_TypeDef* stream) {
#if defined(HAL_DMA_MODULE_ENABLED) && defined(FASTLED_STM32_HAS_DMA_STREAMS)
    if (stream == nullptr) {
        return;
    }

    DMA_TypeDef* dma = getDMAController(stream);
    u8 stream_idx = getStreamIndex(stream);

    if (dma == nullptr || stream_idx == 0xFF) {
        return;
    }

#if defined(FL_IS_STM32_H7)
    // STM32H7: Use direct register access to clear flags
    // Clear all interrupt flags for this stream (TC, HT, TE, DME, FE)
    if (stream_idx < 4) {
        // Streams 0-3: Use LIFCR (Low Interrupt Flag Clear Register)
        static const u32 clear_flags[] = {
            DMA_LIFCR_CTCIF0 | DMA_LIFCR_CHTIF0 | DMA_LIFCR_CTEIF0 | DMA_LIFCR_CDMEIF0 | DMA_LIFCR_CFEIF0,
            DMA_LIFCR_CTCIF1 | DMA_LIFCR_CHTIF1 | DMA_LIFCR_CTEIF1 | DMA_LIFCR_CDMEIF1 | DMA_LIFCR_CFEIF1,
            DMA_LIFCR_CTCIF2 | DMA_LIFCR_CHTIF2 | DMA_LIFCR_CTEIF2 | DMA_LIFCR_CDMEIF2 | DMA_LIFCR_CFEIF2,
            DMA_LIFCR_CTCIF3 | DMA_LIFCR_CHTIF3 | DMA_LIFCR_CTEIF3 | DMA_LIFCR_CDMEIF3 | DMA_LIFCR_CFEIF3
        };
        dma->LIFCR = clear_flags[stream_idx];
    } else {
        // Streams 4-7: Use HIFCR (High Interrupt Flag Clear Register)
        static const u32 clear_flags[] = {
            DMA_HIFCR_CTCIF4 | DMA_HIFCR_CHTIF4 | DMA_HIFCR_CTEIF4 | DMA_HIFCR_CDMEIF4 | DMA_HIFCR_CFEIF4,
            DMA_HIFCR_CTCIF5 | DMA_HIFCR_CHTIF5 | DMA_HIFCR_CTEIF5 | DMA_HIFCR_CDMEIF5 | DMA_HIFCR_CFEIF5,
            DMA_HIFCR_CTCIF6 | DMA_HIFCR_CHTIF6 | DMA_HIFCR_CTEIF6 | DMA_HIFCR_CDMEIF6 | DMA_HIFCR_CFEIF6,
            DMA_HIFCR_CTCIF7 | DMA_HIFCR_CHTIF7 | DMA_HIFCR_CTEIF7 | DMA_HIFCR_CDMEIF7 | DMA_HIFCR_CFEIF7
        };
        dma->HIFCR = clear_flags[stream_idx - 4];
    }
#else
    // STM32F2/F4/F7/L4: Use LL driver functions to clear flags
    typedef void (*ClearFunc)(DMA_TypeDef*);
    static const ClearFunc clear_funcs[] = {
        LL_DMA_ClearFlag_TC0, LL_DMA_ClearFlag_TC1,
        LL_DMA_ClearFlag_TC2, LL_DMA_ClearFlag_TC3,
        LL_DMA_ClearFlag_TC4, LL_DMA_ClearFlag_TC5,
        LL_DMA_ClearFlag_TC6, LL_DMA_ClearFlag_TC7
    };

    if (stream_idx < 8) {
        clear_funcs[stream_idx](dma);
    }
#endif

#else
    (void)stream;
#endif
}

void stopDMA(DMA_Stream_TypeDef* stream) {
#if defined(HAL_DMA_MODULE_ENABLED) && defined(FASTLED_STM32_HAS_DMA_STREAMS)
    if (stream == nullptr) {
        return;
    }

    // Disable stream
    stream->CR &= ~DMA_SxCR_EN;

    // Wait for stream to be disabled
    while (stream->CR & DMA_SxCR_EN) {
        // Wait
    }

    // Clear flags
    clearDMAFlags(stream);

    FL_DBG("STM32: DMA stream stopped");
#else
    (void)stream;
#endif
}

#endif  // FASTLED_STM32_HAS_DMA_STREAMS && FL_STM32_HAS_SPI_HW_*

#endif  // FL_STM32_HAS_HAL

}  // namespace stm32
}  // namespace fl

#endif  // FL_IS_STM32
